recipes/tan-tan-noodles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tan Tan Noodles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Tan Tan Noodles</h1>
<p>
<a href="https://www.youtube.com/watch?v=2DnezXrRVAQ">Original link</a>
</p>

<p>
This recipe will make a single serving.
</p>

<div id="outline-container-org29f9fc9" class="outline-2">
<h2 id="org29f9fc9">Ingredients</h2>
<div class="outline-text-2" id="text-org29f9fc9">
</div>
<div id="outline-container-orga8d8824" class="outline-3">
<h3 id="orga8d8824">Noodles</h3>
<div class="outline-text-3" id="text-orga8d8824">
<ul class="org-ul">
<li>drizzle of olive oil</li>
<li>1/4 cup canned sliced bamboo</li>
<li>1/4 cup corn</li>
<li>fresh cracked pepper</li>
<li>1/4 cup dried wild mushrooms (rehydrated)</li>
<li>pinch of pink salt</li>
<li>1 bundle of dried ramen noodles</li>
<li>2 cups veggie stock</li>
<li>5g kombu</li>
<li>1 tbsp white sesame paste (Chinese style or tahini)</li>
<li>1 tsp sesame oil</li>
<li>1 tsp rice vinegar</li>
<li>1 tbsp soy sauce</li>
<li>1 tsp cane sugar</li>
<li>1 tsp + 1 tbsp chili oil (<a href="https://youtu.be/DUDKIcYltZA">https://youtu.be/DUDKIcYltZA</a>)</li>
<li>1/4 cup cashew milk (canned coconut milk will work too!)</li>
<li>1 stick green onion</li>
</ul>
</div>
</div>
<div id="outline-container-orge08483c" class="outline-3">
<h3 id="orge08483c">Garnishes</h3>
<div class="outline-text-3" id="text-orge08483c">
<ul class="org-ul">
<li>1 tbsp korean dried chili pepper threads</li>
<li>1 <a href="./cashew-ramen-egg.html">cashew ramen egg</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd682ad5" class="outline-2">
<h2 id="orgd682ad5">Method</h2>
<div class="outline-text-2" id="text-orgd682ad5">
<ol class="org-ol">
<li>Bring a pot of water to boil for the noodles. In the meantime, heat up a sauté pan on medium high heat and add a drizzle of olive oil</li>
<li>Sauté the bamboo for a few minutes. Add the corn and sauté for another minute. Then, set aside</li>
<li>Mince the rehydrated wild mushrooms and sauté with a pinch of pink salt for 2-3min. Then, set aside</li>
<li>Cook the noodles in boiling water to package instructions and loosen the noodles with chopsticks occasionally</li>
<li>Heat up the veggie stock and kombu in the sauté pan (or in a stock pot if multiplying the recipe)</li>
<li>Add the sesame paste, sesame oil, rice vinegar, soy sauce, cane sugar, and 1 tsp chili oil to your serving bowl. Whisk to combine</li>
<li>When the broth comes to a boil, remove the kombu. Turn the heat off. When the broth is no longer boiling, add the cashew milk in while whisking</li>
<li>Pour the broth into the serving bowl. Strain out the cooked noodles and add to the bowl</li>
<li>Top the ramen with the bamboo, corn, wild mushrooms, fresh chopped green onion, Korean dried chili pepper threads, cashew ramen egg, and 1 tbsp chili oil</li>
</ol>
</div>
</div>
</div>
</body>
</html>
